// FigureKeeper.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "PlaneFigure.h"
#include "VolumeFigure.h"
#include "Exceptions.h"
using namespace std;

int main() {
    try {
        double s[3] = { 3, 4, 5 };
        PlaneFigure t("triangle", s, 3);
        t.print();
        t.draw();

        double c[2] = { 2, 5 };
        VolumeFigure v("cylinder", c, 2);
        v.print();
        v.draw();

        PlaneFigure bad("circle", s, 3);   // 3 размера у круга: должна быть ошибка
    }
    catch (const FigureException& e) {
        cout << "Error: " << e.what() << endl;
    }
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
